// Запитуємо вік юзера через prompt
let age = prompt('Введіть ваш вік:');

// натиснення кнопки скасувати закриє форму
if (age === null) {
  // Виводимо повідомлення про закриття форми вводу
  alert('Гуд бай май діар френд');
} else {
  // Перевірка на пробіли
  age = age.replace(/\s/g, '');

  // Дивимось чи введено не порожній рядок
  if (age !== '') {
    // Дививмось чи юзер ввів число і чи воно не відʼємне
    if (!isNaN(age) && age >= 0) {
      // Визначаємо останню цифру віку
      const lastDigit = age % 10;
      // Визначаємо слово яке будемо виводити в залежності від останньої цифри
      let word;
      if (lastDigit === 1) {
        word = 'рік';
      } else if (lastDigit >= 2 && lastDigit <= 4) {
        word = 'роки';
      } else {
        word = 'років';
      }
      // Виводимо результат
      alert(age + ' ' + word);
    } else {
      // Якщо ввели не коректне значення віку, виводимо наступний текст
      alert('Введено некоректне значення віку.');
    }
  } else {
    // Повідомлення якщо ввели пустий рядок
    alert('Введено порожній рядок.');
  }
}
